var store = [{
        "title": "Introducing KAMONOHASHI — A platform for deep learning",
        "excerpt":"  Introduction KAMONOHASHIはDeep Learning を活用したアプリケーション開発を容易にするプラットフォームです。技術者が、組織でDeep learning開発を行う上で直面する煩雑な問題を解決します。 リソース管理:テナントごとに、GPUやストレージのリソースの管理を容易に行えます。 トレーサビリティ:大量に行われる実験の環境情報や入出力データを自動的に記録します。履歴を体系的に保存することで、試行錯誤プロセスが可視化できます。結果の分析レポートやログなど関連情報も学習結果と紐づけて一元管理可能です。 学習環境のバージョン管理:コンテナ技術を活用し、環境のバージョンアップや過去断面の再現が手軽に実施でき、環境自体の履歴管理が可能です。 マルチUI:多様なUIによる自動化・分業化により、画像認識を行う過程で生じる副次的作業を減らし、Deep learning 技術者を主業務に集中させます。 Ecosystem 2018.6.22 update service Status Description kamonohashi cli Python 2.7.x /3.5.x and greater A command line interface to KAMONOHASHI kamonohashi sdk Python 2.7.x /3.5.x and greater KAMONOHASHI SDK for Python kamonohashi GUI TBA A graphical user interface to...","categories": ["KAMONOHASHI"],
        "tags": [],
        "url": "http://localhost:4000/posts/introduction",
        "teaser":null},{
        "title": "GTC Japan 2018に出展します",
        "excerpt":"    GTC Japan 2018に出展します   GTC Japan は、NVIDIA が主催する日本最大の AI 開発者カンファレンスです。   NVIDIA の GPU Technology Conference (GTC) は、コンピューティング分野で、最重要でかつ不可欠とされるトレーニング、貴重なインサイト、NVIDIA をはじめとする主要な組織の専門家とのネットワーキングが 1 枚のパスで体験できる大変貴重な場となっています。        場所 日程 会場     東京 9月13日・14日 [グランドプリンスホテル新高輪 国際館パミール](http://www2.princehotels.co.jp/newtakanawa/access/ グランドプリンスホテル新高輪 国際館パミール)     KAMONOHASHIを開発している新日鉄住金ソリューションズ㈱は初めてエキシビジョン・スポンサーとして協賛出展し、AI開発プラットフォーム「KAMONOHASHI」を展示致します。是非ブースへお立ち寄りください。   ","categories": [],
        "tags": [],
        "url": "http://localhost:4000/posts/gtc2018",
        "teaser":null},{
        "title": "SIerで2年間 Deep Learning プロジェクトをやり続けて気づいた成功の4つのポイント",
        "excerpt":"  2015年から2年以上に渡り様々な Deep Learning プロジェクトに携わってきました。プロジェクトの具体的な内容は、製造業向けの画像認識です。 世の中で Deep Learning は大きな話題となっています。ところが、カンファレンス等で実際に Deep Learning のプロジェクトを担当している方と 懇親会等で話すと成功しているプロジェクトはあまりないとみなさん口をそろえて言っています。 そこで、この記事ではこれまでの経験から気づいた、成功しているプロジェクトに共通するの4つのポイントを解説します。 Deep Learning のプロジェクトというより、機械学習一般に対して言えることなので、Deep Learning や機械学習のプロジェクトに携わっている方 もしくはこれから携わる方にぜひ参考にしてもらえればと思います。 前提 対象とするプロジェクト 教師あり機械学習 エンジニアが Deep Learning モデルを作成する(TensorFlow や PyTorch などを使ってモデルを構築しデータから学習させて利用する) データはプロジェクト関係者が収集し教師データを作成する Deep Learning や機械学習の原理ができることをある程度理解している 対象読者 Deep Learning (もしくは機械学習・AI・人工知能)のプロジェクトを企画・運営していく人 経営の立場から Deep Learning に興味があり社内のどういったことに適用していくべきか検討している方 プロジェクト成功の4つのポイント プロジェクト成功の4つのポイントは以下の通りです。 コストメリット 入力完全性 データ収集容易性 目標正解率 上から順番に重要な項目が並べてあります。一つ一つ説明していきます。 コストメリット...","categories": ["DeepLearning"],
        "tags": [],
        "url": "http://localhost:4000/posts/sier",
        "teaser":null},{
        "title": "GTC Japan2018参加報告",
        "excerpt":"    GTC Japan2018参加報告   こんにちは。KAMONOHASHIチームです。 9/13,14に参加した、GTC Japanについて報告をします。     GTCとは   GTC Japan は、NVIDIA が主催する日本最大の AI 開発者カンファレンスです。   NVIDIA の GPU Technology Conference (GTC) は、コンピューティング分野で、最重要でかつ不可欠とされるトレーニング、貴重なインサイト、NVIDIA をはじめとする主要な組織の専門家とのネットワーキングが 体験できる貴重な場です。   KAMONOHASHIブースの出展をしました   弊チームでは2日間に渡り、ポスターとデモ展示を行いました。       ご来場いただいたみなさま、ありがとうございました。   多くの方にご来場いただいたなかで、 多くの企業や組織においてDeep Learning の取り組みはすでに始まっており、 今後取り組みを拡大していく段階にきているという印象を受けました。   さいごに   今回のブログではGTC Japanに2日間で出展したKAMONOHASHIブースについてお伝えしました。 GPUによって、Deep Learning関連技術は発展を遂げている最中です。 KAMONOHASHIは、チームでのDeep Learningの取り組みを拡大する際の一助となれるよう、 今後も関連技術をキャッチアップしていきます。  ","categories": ["KAMONOHASHI"],
        "tags": [],
        "url": "http://localhost:4000/posts/gtc2018done",
        "teaser":null},{
        "title": "TechPlay参加報告",
        "excerpt":"    TechPlayとは   テクノロジーに関わる様々なイベントや勉強会が開催されている、TECH PLAY で、2018年9月19日、KAMONOHASHIチームメンバーが発表しました。当日は弊社新日鉄住金ソリューションズのなかで、「AI」をテーマとして2つのプレゼンテーションを行いました。KAMONOHASHIはそのうちの1テーマとして発表しました。     発表内容   KAMONOHASHIチームの発表タイトルは『AI 開発プラットフォーム「KAMONOHASHI」とは何か及びその内部構造の紹介』。スライドはこちらから見られます。 KAMONOHASHIは一言で言うと「AI開発において発生する3つの課題を解決するもの」です。 発表スライドの中では -  AI開発とは？ -  3つの課題とは？ -  KAMONOHASHIは3つの課題をどのように解決しているのか？ -  KAMONOHASHIの詳細の内部構造 が紹介されています。 内容が長いため、今後当ブログで何回かに分けて連載予定です。乞うご期待！   TechPlay #2   10/30(火)19:00~21:00にNSSOL Tech Talk 【第三次AIブームは本物か？】と題しまして、弊社として2回目のTechPlayを開催します。 現在、第三次AIブームと言われています。第一次ブームの心理学や哲学的論争とアルゴリズムの発案、第二次ブームの実学的な発展などにも触れて、今回のブームの状況を弊社NSSOLの事例から説明します。同時に、今後の社会の要求に対して、AIがどのように貢献していけるかも説明します。 詳細・お申込みはこちらからお願いします。   さいごに   今回のブログでは、新日鉄住金ソリューションズ㈱としても、もちろんKAMONOHASHIチームとしてもはじめて参加したTechPlayでの発表について報告しました。 今後もKAMONOHASHIチームではDeep Learningに関連する記事やAI開発プラットフォーム「KAMONOHASHI」について情報を発信していきます。       ","categories": ["KAMONOHASHI"],
        "tags": [],
        "url": "http://localhost:4000/posts/techplay",
        "teaser":null},{
        "title": "10/20経営情報学会にてセッション発表します",
        "excerpt":"    経営情報学会とは   経営情報学会は1992年4月1日に経営情報に関する研究の推進と議論の場として設立されました。公㏋はこちら     経営情報学会の目的   経営情報学会は、経営情報にかかわる諸問題の研究および応用を促進し、会員相互および関連する学協会との情報交換をはかるとともに、経営情報学の確立、産業の進歩発展に寄与することが目的とされています。       秋季全国研究発表大会について   今季の大会テーマは「AI時代における高付加価値化」。 大会公式HPによると、   これからのビジネスを担うのは、サービスデザイン等の顧客視点に立った新たな価値の創出や、AIやIoTの活用によるエコシステムの構築であろう  との思いが込められているそうです。   日時・場所      日時：2018年10月20日（土）・21日（日）   場所：近畿大学　東大阪キャンパス   発表内容   Deep Learningを用いたシステム開発の際に使用しているKAMONOHASHIの紹介を通してAIプラットフォームに求められる機能について発表します。 大会プログラムはこちら   さいごに   先月までKAMONOHASHIは開発者向けのカンファレンス・勉強会に参加し発表していました。(参考：GTCの参加報告TechPlayの参加報告)   今回は、はじめて経営・経済系の学会に参加します。 KAMONOHASHIとはまだまだ接点が薄い分野において、 様々な参加者・発表者の方々とDeep Learning技術やAI開発プラットフォームの可能性について探ることができれば、と考えています。       ","categories": ["KAMONOHASHI"],
        "tags": [],
        "url": "http://localhost:4000/posts/jasmin",
        "teaser":null},{
        "title": "経営情報学会参加報告",
        "excerpt":"    こんにちは。KAMONOHASHIチームです。 今回は先日参加した経営情報学会について報告します。     学会概要   前回のブログでご紹介した通り、 先日経営情報学会に参加してきました。 本大会では、ポスターセッション、一般発表セッション、企業セッションがあり、 KAMONOHASHIチームは企業セッションにて発表しました。   発表内容   まず、近年、第三次AIブームが再来したきっかけとなったDeep Learningについて、その概要と進歩の原動力(データ・計算パワー)についてお話しました。そして今後企業や組織にてAI開発の取り組みを拡大する際に、AI開発者やシステム管理者が直面するであろう問題点を挙げ、 KAMONOHASHIを一例にとって、問題点を解決するAIプラットフォームの必要性をご説明しました。   具体的には、チームや組織でAIを利用したシステム開発を実行する際には「環境設定」「再現性(トレーサビリティ)」「GPUリソース共有」の3つの問題点が浮上することを、弊社のAI開発チームの体制を例にとってご説明しました。 今回のセッションの発表時間は20分と短かったため、これらの問題点のうち、「GPUリソース共有」について、解決方法をKAMONOHASHIを例にとってご説明しました。   まとめとしましては、Deep Learningを中心とするAIの技術はデータと計算パワーによって今後も発展していくと思われますが、チームや組織で取り組みを拡大していく際には、「環境設定」「再現性(トレーサビリティ)」「GPUリソース共有」の問題を解決するようなAIプラットフォームが必要であることをご説明いたしました。さらに、ビジネス的観点としては、今後AI開発の取り組みが進んでいくにつれて、AIプラットフォームの有無が、企業のAI競争力の差に結びついていくのではないか？との考察を述べさせていただきました。   所感   発表は大会1日目の午前中であり、企業セッションは2つと少なかったため、 聞いてくださる方は10名程度くらいではないか？と予想していました。 しかし、予想に反して約30名の方にお越しいただき、質問も質問時間10分を超えるなど、刺さる方には刺さった発表だったようです。   おまけ   学会が開催された、近畿大学は近大マグロで有名な大学です。懇親会会場ではインパクトのある近大マグロをお目にかかることができました。 (懇親会ではお刺身をいただきました。とても美味しかったです。) 懇親会では普段KAMONOHASHIチームとは交流の薄い、経営学界のアカデミアにいる方々ともお話できたことで、 大学におけるAI活用の研究の現状についてうかがい知ることができ、とても興味深かったです。          また、学会大会会場は昨年度新設されたアカデミックセンターにて行われました。 建物の1Fには、ラーニングコモンズと一般的に呼ばれる図書とインターネット環境を備えた学習スペースやカフェがある、学生が主体的に学ぶことができるスペースが広がっており、とても先進的で印象に残りました。   最後に   今回はKAMONOHASHIチームとしてはじめて、経営学界のアカデミアの方々が多くいる学会に参加しました。今後も今回得られたつながりを生かし、世の中のAI開発の取り組み拡大に貢献していきたいと思います。   発表時間の関係もあり、今回はKAMONOHASHIの一部の機能(GPUリソース共有)のみの紹介であったため、「環境設定」「再現性(トレーサビリティ)」に関しては、今後のKAMONOHASHIブログにて詳細に取り上げてまいります。概要としては、9月に登壇したTech Playイベントの記事や、発表資料をぜひご覧ください。   最後に、KAMONOHASHIチームでは、企業に限らずアカデミアの学会などにも積極的に参加し、最近の企業内でのリアルなAI開発状況・体制についてお話させていただいています。お話を聞いてみたい！と思われた方はぜひ[kamonohashi-support@jp.nssol.nipponsteel.com]までご連絡いただけますと幸いです。       ","categories": ["KAMONOHASHI"],
        "tags": [],
        "url": "http://localhost:4000/posts/jasmindone",
        "teaser":null},{
        "title": "導入までの流れ",
        "excerpt":"KAMONOHASHIを活用してDeep Learning開発組織を立ち上げるためのステップ     AI環境についての話し合い 使用中のツール、過去に構築済みのモデル、既存の機械学習の適用先、組織的な役割などをお客様と話し合います。 KAMONOHASHIの構成説明や導入予定先の環境確認を行い、導入する際の問題やリスクを検討します。   事前検証の実施 お客様の環境と同等の環境を構築し、KAMONOHASHI構築検証を行います。 ユーザ数や学習規模など、お客様の利用想定を元に、 管理サーバ、NFSのストレージ容量を試算する支援を行います。   KAMONOHASHI導入 KAMONOHASHIの動作に必要なKubernetesを管理サーバ上に構築し、 管理サーバおよびGPUサーバ上にKAMONOHASHIを構築します。   トレーニングの実行 KAMONOHASHIの一般ユーザ・管理者向け機能の標準的な利用方法について、各1～2時間程度のトレーニングを行い、 組織内で構築された AI 文化を支えるための質問の場を設けます。   関連情報  導入サービスを利用せず、お客様ご自身でKAMONOHASHIを導入する場合は、以下のドキュメントをご参考ください。   KQI確認済み動作環境一覧    KQI管理者マニュアル    KQI利用者マニュアル    KQI CLIインストールマニュアル    KQIインストールマニュアル    チュートリアル     ","categories": ["KAMONOHASHI"],
        "tags": [],
        "url": "http://localhost:4000/posts/support",
        "teaser":null}]
